---
type: ImagePlacementOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ImagePlacementOptions

`Autodesk.Revit.DB.ImagePlacementOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ImagePlacementOptions | — | `` |
| Constructor | ImagePlacementOptions | 2020 | `public ImagePlacementOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Location | 2020 | `public XYZ Location { get ; set ; }` |
| Property | PlacementPoint | 2020 | `public BoxPlacement PlacementPoint { get ; set ; }` |